; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   white_block_1 purple_block_1 blue_block_1 red_block_1 grey_block_1 white_block_2 blue_block_2 - block
 )
 (:init (ontable white_block_1) (ontable purple_block_1) (on blue_block_1 white_block_1) (on red_block_1 purple_block_1) (ontable grey_block_1) (on white_block_2 blue_block_1) (on blue_block_2 white_block_2) (clear red_block_1) (clear grey_block_1) (clear blue_block_2) (handempty) (= (total-cost) 0))
 (:goal (and (ontable blue_block_2)))
 (:constraints (sometime (not (on red_block_1 white_block_1))) (sometime-after (not (on red_block_1 white_block_1)) (ontable white_block_2)) (sometime (not (on grey_block_1 white_block_1))) (sometime-after (not (on grey_block_1 white_block_1)) (not (clear red_block_1))) (sometime (not (ontable blue_block_1))) (sometime-after (not (ontable blue_block_1)) (on purple_block_1 grey_block_1)) (sometime (clear white_block_2)) (sometime-before (clear white_block_2) (not (clear grey_block_1))) (sometime (not (ontable grey_block_1))))
 (:metric minimize (total-cost))
)

; plan
1. (unstack red_block_1 purple_block_1)
   deleted: (on red_block_1 purple_block_1) (clear red_block_1) (handempty)
   added: (holding red_block_1) (clear purple_block_1)
   goals met: 0 of 1
2. (putdown red_block_1)
   deleted: (holding red_block_1)
   added: (clear red_block_1) (handempty) (ontable red_block_1)
   goals met: 0 of 1
3. (pickup purple_block_1)
   deleted: (clear purple_block_1) (ontable purple_block_1) (handempty)
   added: (holding purple_block_1)
   goals met: 0 of 1
4. (stack purple_block_1 grey_block_1)
   deleted: (clear grey_block_1) (holding purple_block_1)
   added: (handempty) (clear purple_block_1) (on purple_block_1 grey_block_1)
   goals met: 0 of 1
5. (unstack blue_block_2 white_block_2)
   deleted: (on blue_block_2 white_block_2) (clear blue_block_2) (handempty)
   added: (holding blue_block_2) (clear white_block_2)
   goals met: 0 of 1
6. (stack blue_block_2 red_block_1)
   deleted: (clear red_block_1) (holding blue_block_2)
   added: (handempty) (clear blue_block_2) (on blue_block_2 red_block_1)
   goals met: 0 of 1
7. (unstack white_block_2 blue_block_1)
   deleted: (on white_block_2 blue_block_1) (clear white_block_2) (handempty)
   added: (holding white_block_2) (clear blue_block_1)
   goals met: 0 of 1
8. (putdown white_block_2)
   deleted: (holding white_block_2)
   added: (clear white_block_2) (handempty) (ontable white_block_2)
   goals met: 0 of 1
9. (unstack blue_block_1 white_block_1)
   deleted: (on blue_block_1 white_block_1) (clear blue_block_1) (handempty)
   added: (holding blue_block_1) (clear white_block_1)
   goals met: 0 of 1
10. (putdown blue_block_1)
   deleted: (holding blue_block_1)
   added: (clear blue_block_1) (handempty) (ontable blue_block_1)
   goals met: 0 of 1
11. (unstack purple_block_1 grey_block_1)
   deleted: (on purple_block_1 grey_block_1) (clear purple_block_1) (handempty)
   added: (holding purple_block_1) (clear grey_block_1)
   goals met: 0 of 1
12. (putdown purple_block_1)
   deleted: (holding purple_block_1)
   added: (clear purple_block_1) (handempty) (ontable purple_block_1)
   goals met: 0 of 1
13. (pickup grey_block_1)
   deleted: (clear grey_block_1) (ontable grey_block_1) (handempty)
   added: (holding grey_block_1)
   goals met: 0 of 1
14. (stack grey_block_1 white_block_1)
   deleted: (clear white_block_1) (holding grey_block_1)
   added: (handempty) (clear grey_block_1) (on grey_block_1 white_block_1)
   goals met: 0 of 1
15. (unstack blue_block_2 red_block_1)
   deleted: (on blue_block_2 red_block_1) (clear blue_block_2) (handempty)
   added: (holding blue_block_2) (clear red_block_1)
   goals met: 0 of 1
16. (putdown blue_block_2)
   deleted: (holding blue_block_2)
   added: (clear blue_block_2) (handempty) (ontable blue_block_2)
   goals met: 1 of 1
